app/controllers/api/v1/messages_controller.rb

UPDATE "users" SET "sign_in_count" = $1, "current_sign_in_at" = $2, "last_sign_in_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5
---
    def create
        @message = Message.new(message_params)
        @message.user = current_user
        @message.fulfillment = Fulfillment.find(params[:fulfillment_id])
        if @message.save