app/controllers/api/v1/messages_controller.rb

    def create
        @message = current_user.messages.create(body: msg_params[:body], room_id: params[:room_id])
---
INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "4290e8b6-8fad-4f56-8d1d-194c05c39259"], ["room_id", 1], ["body", "Hi "], ["created_at", "2022-04-01 14:45:48.719685"], ["updated_at", "2022-04-01 14:45:48.719685"]]