app/controllers/api/v1/requests_controller.rb

  def pending
    pending_requests = Request.where(situation: 'pending' , user_id: current_user.id)

    if !pending_requests.empty?
---
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = $1  [["user_id", 4290]]

  def update
    @request = Request.find(params[:id])
    @request.user = current_user
    if @request.update(request_params)
---
UPDATE "users" SET "sign_in_count" = $1, "current_sign_in_at" = $2, "last_sign_in_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5