app/controllers/api/v1/requests_controller.rb

  def create
    @request = Request.new(request_params)
    @request.user = current_user
    if @request.save
---
INSERT INTO "requests" ("description", "address", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", ""], ["address", ""], ["user_id", 4290], ["created_at", "2022-03-18 08:24:32.184608"], ["updated_at", "2022-03-18 08:24:32.184608"]]

  def destroy
    @request = Request.find(params[:id])
    @request.destroy
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "requests" WHERE "requests"."id" = $1  [["id", 2]]