app/models/user.rb

    def ensure_authentication_token_is_present
      if authentication_token.blank?
---
SELECT "users".* FROM "users" WHERE "users"."authentication_token" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["authentication_token", "VMyXfzrpknb3yjWUgbhr"], ["LIMIT", 1]]

    def generate_authentication_token
      loop do
        token = Devise.friendly_token
        break token unless User.where(authentication_token: token).first
---
SELECT "users".* FROM "users" WHERE "users"."authentication_token" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["authentication_token", "wWquYapka7wfjFWW9V1i"], ["LIMIT", 1]]